In [1]:
import pandas as pd

In [2]:

df = pd.DataFrame([12,34,55,11,10])

In [3]:
df

    0
0  12
1  34
2  55
3  11
4  10

In [4]:
df1 = pd.DataFrame ({'Name':['sourav','priya','simran']})

In [5]:
df1

     Name
0  sourav
1   priya
2  simran

In [6]:
df1.head()

     Name
0  sourav
1   priya
2  simran

In [7]:
df1

     Name
0  sourav
1   priya
2  simran

In [8]:
df1.tail()

     Name
0  sourav
1   priya
2  simran

In [9]:
#access
df1['Name']
df1.Name[:3]

0    sourav
1     priya
2    simran
Name: Name, dtype: str

In [10]:
df.loc[:'class']

    0
0  12
1  34
2  55
3  11
4  10

In [11]:
df1

     Name
0  sourav
1   priya
2  simran